import matplotlib.pyplot as plt
plt.rcParams['font.sans-serif']=['SimHei']
plt.rcParams['axes.unicode_minus']=False
y1=[100280,110863,121717,137422,161840,187319,219439,270092,319245,348518,
412119,487940,538580,592963,643563,688858,746395,832036,919281,990865]
y2=[287882.2071,331457.3756,372928.9402,378315.4702,428696.3996,426537.0785,445599.2615,528661.3198,653300.4376,636596.3331,747622.1615,820278.9777,789911.3111,831391.2898,845383.9223,892793.2486,890918.2404,926510.0937,954303.3184,976708.4576
]

x=['2000','2001','2002','2003','2004','2005','2006','2007','2008','2009',
   '2010','2011','2012','2013','2014','2015','2016','2017','2018','2019']
fig=plt.figure(figsize=(10,8),dpi=80)

barwidth=0.4
x1=list(range(len(x)))
x2=[i-barwidth/2 for i in x1]
x3=[i+barwidth/2 for i in x1]

plt.bar(x2,y1,width=barwidth,color='orange')
plt.ylabel('中国国内生产总值（亿元人民币）')
plt.twinx()
plt.bar(x3,y2,width=barwidth,color='b')
plt.ylabel('中国实际利用世界外商直接投资(百万人民币)')
plt.title('图2.1.1  中国GDP与利用外商投资趋势',y=-0.1)





plt.xticks(x1,x)
plt.show()